In [2]:
import pandas as pd
import numpy as np

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [11]:
df= pd.read_csv('student2.csv')

In [13]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [18]:
df=df[['roll','marks','age']]

In [19]:
df.mean()

roll      5.500000
marks    63.915000
age      20.555556
dtype: float64

In [21]:
df.median()

roll      5.500
marks    61.525
age      20.000
dtype: float64

In [24]:
df.mode()

   roll  marks   age
0     1  49.55  20.0
1     2  56.75   NaN
2     3  56.77   NaN
3     4  59.77   NaN
4     5  63.28   NaN
5     6  69.66   NaN
6     7  76.88   NaN
7     8  78.66   NaN
8     9    NaN   NaN
9    10    NaN   NaN

In [25]:

#standarad deviation
df.std()

roll      3.027650
marks    10.315294
age       1.333333
dtype: float64

In [26]:
df.min()
#min

roll      1.00
marks    49.55
age      19.00
dtype: float64

In [27]:

df.max()
#max

roll     10.00
marks    78.66
age      23.00
dtype: float64

In [28]:

import numpy as np

In [29]:

np.std(df['marks'])

9.649073789747904

In [31]:
df1= pd.read_csv('student2.csv')

In [32]:

gr1 = df1.groupby('class')

In [33]:
te = gr1.get_group('TE')

In [34]:
te.min()

roll           1
name     ajinkya
class         TE
marks      56.75
age         20.0
dtype: object

In [35]:
te.max()

roll         9
name      anil
class       TE
marks    69.66
age       22.0
dtype: object

In [36]:
gr2 = df.groupby('age')

In [37]:
gr2.groups

{19.0: [2, 6], 20.0: [4, 5, 8], 21.0: [1, 9], 22.0: [0], 23.0: [7]}

In [38]:

tw = gr2.get_group(20)

In [39]:
tw

   roll  marks   age
4     5  63.28  20.0
5     6  49.55  20.0
8     9  56.75  20.0

In [40]:

import seaborn as sns

In [41]:

df = sns.load_dataset('iris')

In [42]:

df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [53]:

df =px.data.iris()

NameError: name 'px' is not defined

In [54]:


df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [55]:

gr = df.groupby('species')

In [56]:
se = gr.get_group('setosa')
ve = gr.get_group('versicolor') 
vi = gr.get_group('virginica')

In [57]:

se.shape

(50, 5)

In [58]:

ve.shape

(50, 5)

In [59]:

vi.shape

(50, 5)

In [60]:

se.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000    50.000000
mean        5.00600     3.428000      1.462000     0.246000
std         0.35249     0.379064      0.173664     0.105386
min         4.30000     2.300000      1.000000     0.100000
25%         4.80000     3.200000      1.400000     0.200000
50%         5.00000     3.400000      1.500000     0.200000
75%         5.20000     3.675000      1.575000     0.300000
max         5.80000     4.400000      1.900000     0.600000

In [61]:

ve.describe()

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [62]:

vi.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000